declination = {1: "один процент", 2: "два процента", 3: "три процента", 4: "четыре процента", 5: "пять процентов",
               6: "шесть процентов",
               7: "семь процентов", 8: "восемь процентов", 9: "девять процентов", 10: "десять процентов",
               11: "одинадцать процентов", 12: "двенадцать процентов",
               13: "тринадцать процентов", 14: "четырнадцать процентов", 15: "пятнадцать процентов",
               16: "шестьнадцать процентов", 17: "семнадцать процентов", 18: "восемнадцать процентов",
               19: "девятнадцать процентов", 20: "двадцать процентов", }


def procent(x):
    x = int(x)
    print(declination.get(x))


while True:
    x = input("сколько процентов?(1 до 20): ")
    if x.isdigit():
        procent(x)
    else:
        break

print(declination)
